Управляемые формы 1С 8.3/Documents/ПриготовлениеПродуктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриготовлениеПродуктов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продукты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПорций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Управляемые формы 1С 8.3/AccumulationRegisters/Продукты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продукты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Управляемые формы 1С 8.3/Documents/ПриготовлениеПродуктов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Выставляем флаг записи набора Продукты
	Движения.Продукты.Записывать = Истина;
	
	//Выбираем данные для проведения
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриготовлениеПродуктовПродукты.Продукт КАК Продукт,
	               |	СУММА(ПриготовлениеПродуктовПродукты.Количество) КАК Количество
	               |ПОМЕСТИТЬ втДанныеДокумента
	               |ИЗ
	               |	Документ.ПриготовлениеПродуктов.Продукты КАК ПриготовлениеПродуктовПродукты
	               |ГДЕ
	               |	ПриготовлениеПродуктовПродукты.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриготовлениеПродуктовПродукты.Продукт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДанныеДокумента.Продукт КАК Продукт,
	               |	втДанныеДокумента.Количество КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ПродуктыОстатки.КоличествоОстаток, 0) >= втДанныеДокумента.Количество
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ДостаточноОстатков,
	               |	ВЫБОР
	               |		КОГДА втДанныеДокумента.Количество = ЕСТЬNULL(ПродуктыОстатки.КоличествоОстаток, 0)
	               |			ТОГДА ЕСТЬNULL(ПродуктыОстатки.СуммаОстаток, 0)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ЕСТЬNULL(ПродуктыОстатки.КоличествоОстаток, 0) = 0
	               |					ТОГДА 0
	               |				ИНАЧЕ ЕСТЬNULL(ПродуктыОстатки.СуммаОстаток, 0) / ЕСТЬNULL(ПродуктыОстатки.КоличествоОстаток, 0) * втДанныеДокумента.Количество
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Стоимость,
	               |	втДанныеДокумента.Продукт.Представление КАК ПродуктПредставление
	               |ИЗ
	               |	втДанныеДокумента КАК втДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продукты.Остатки(
	               |				&МоментВремени,
	               |				Продукт В
	               |					(ВЫБРАТЬ
	               |						втДанныеДокумента.Продукт КАК Продукт
	               |					ИЗ
	               |						втДанныеДокумента КАК втДанныеДокумента)) КАК ПродуктыОстатки
	               |		ПО втДанныеДокумента.Продукт = ПродуктыОстатки.Продукт";
	
	Запрос.УстановитьПараметр("МоментВремени",  МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Проверяем можно ли провести документ
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл				
		Если НЕ ВыборкаДетальныеЗаписи.ДостаточноОстатков Тогда
			Сообщить("Внимание! Недостаточно продукта: " + ВыборкаДетальныеЗаписи.ПродуктПредставление);
			Отказ = Истина;
		КонецЕсли;			
	КонецЦикла;
	
	//Если всё хорошо, то документ проводим
	Если НЕ Отказ Тогда
		
		СтоимостьНовогоПродукта = 0;
		
		//Формируем движения по регистру Продукты
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
			
			Движение = Движения.Продукты.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			Движение.Период 		= Дата;
			Движение.Продукт		= ВыборкаДетальныеЗаписи.Продукт;
			Движение.Количество 	= ВыборкаДетальныеЗаписи.Количество;
			Движение.Сумма 			= ВыборкаДетальныеЗаписи.Стоимость;	
			
			СтоимостьНовогоПродукта = СтоимостьНовогоПродукта + Движение.Сумма;
				
		КонецЦикла;
		
		Движение = Движения.Продукты.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Продукт		= Продукт;
		Движение.Количество 	= КоличествоПорций;
		Движение.Сумма 			= СтоимостьНовогоПродукта;
			
	КонецЕсли;
			
КонецПроцедуры
